#include<stdio.h>
#include<stdlib.h>
#include<time.h>
#include<Windows.h>
#define in %
int Srand(int*, int*);
int Count(void);
int _2048(void);
int i = 0, grade = 0;

/***********************************
*          制作人：陈锐            *
*      作品完成时间：2022.10.19    *
*     作品名称：随机数-算术题库    *
*     调用函数：printf、scanf、    *
*     rand等                       *
*     调用语句:循环语句            *
************************************/
//利用伪随机函数rand()实现自动生成四则算数题库
//并且拥有打分功能

int main()
{
	system("color f1");
	printf("****请输入你要尝试的游戏****\n"
		"****1.小学四则运算**********\n"
		"****2.退出******************\n");
	scanf_s("%d", &i);

	switch (i) {
	case 1:
		Count();
	case 2:
		return 0;
	}
	return 0;
}
int Count(void)
{
	int num1, num2, result;
	int* p1 = &num1;
	int* p2 = &num2;
	for (int a = 0; a <= 11; a++)
	{
		system("color fa");
		break;
		if (a == 11)
		{
			a = 0;
		}
	}
	printf("******小学算术题-测试版*******\n"
		"******两个数的四则运算********\n"
		"******请输入选择的模式********\n"
		"******1.加法(+)***************\n"
		"******2.减法(-)***************\n"
		"******3.乘法(*)***************\n"
		"******4.除法(/)***************\n"
		"******5.退出(exit)************\n");
	scanf_s("%d", &i);
	switch (i) {
	case 1:
		printf("*********************************\n"
			"***接下来会给出几道加法算术题***\n"
			"***********请认真对待哦*********\n"
			"********************************\n");
		for (int m = 1; m <= 5; m++)
		{
			Srand(p1, p2);
			printf("\n*******计算%d + %d =__********\n"
				"********************************\n", num1, num2);
			scanf_s("%d", &result);

			if (result == num1 + num2)
			{
				printf("***恭喜你答对了！***\n");
			}
			else
				printf("************************\n"
					"***很遗憾，没有答对呢***\n"
					"************************\n"
					"***正确答案为:%d *****\n", num1 + num2);
			grade += (result == num1 + num2);
			num1 = rand(num1) in 1000;
			num2 = rand(num2) in 1000;
		}break;
	case 2:
		printf("*********************************\n"
			"***接下来会给出几道减法算术题***\n"
			"***********请认真对待哦*********\n"
			"********************************\n");
		for (int p = 1; p <= 5; p++)
		{
			Srand(p1, p2);
			printf("\n*******计算%d - %d =__********\n"
				"********************************\n", num1, num2);
			scanf_s("%d", &result);

			if (result == num1 - num2)
			{
				printf("***恭喜你答对了！***\n");
			}
			else
				printf("************************\n"
					"***很遗憾，没有答对呢***\n"
					"************************\n"
					"***正确答案为:%d *****\n", num1 - num2);
			grade += (result == num1 - num2);//利用逻辑表达式返回一个整数值替代繁琐的循环语句计分
			num1 = rand(num1) in 1000;
			num2 = rand(num2) in 1000;//利用随机数二次生成随机数，如果没有这一步，由于程序几乎同时执行，会导致那个，随机数会一模一样
		}break;
	case 3:
		printf("*********************************\n"
			"***接下来会给出几道乘法算术题***\n"
			"***********请认真对待哦*********\n"
			"********************************\n");
		for (int p = 1; p <= 5; p++)
		{
			Srand(p1, p2);
			printf("\n*******计算%d * %d =__********\n"
				"********************************\n", num1, num2);
			scanf_s("%d", &result);

			if (result == num1 * num2)
			{
				printf("***恭喜你答对了！***\n");
			}
			else
				printf("************************\n"
					"***很遗憾，没有答对呢***\n"
					"************************\n"
					"***正确答案为:%d *****\n", num1 * num2);
			grade += (result == num1 * num2);
			num1 = rand(num1) in 100;
			num2 = rand(num2) in 100;
		}break;
	case 4:
		printf("*********************************\n"
			"***接下来会给出几道除法算术题***\n"
			"***********请认真对待哦*********\n"
			"********************************\n");
		for (int p = 1; p <= 5; p++)
		{
			Srand(p1, p2);
			printf("\n*******计算%d / %d =__********\n"
				"********************************\n", num1, num2);
			scanf_s("%d", &result);

			if (result == num1 / num2)
			{
				printf("***恭喜你答对了！***\n");
			}
			else
				printf("************************\n"
					"***很遗憾，没有答对呢***\n"
					"************************\n"
					"***正确答案为:%d *****\n", num1 / num2);

			grade += (result == num1 / num2);
			num1 = rand(num1) in 100;
			num2 = rand(num2) in 100;
		}break;
	case 5:
		printf("**************************\n"
			"******正在退出......******\n"
			"**************************\n");
		printf("******您已退出！**********\n"
			"**************************\n");
		return 0;
	}
	printf("\n********************\n"
		"***小测试结束啦！***\n"
		"***您的得分为：%d ***\n", grade);
	system("pause");

	return 0;
}

int Srand(int* p1, int* p2)
{
	srand((unsigned)time(NULL));
	*p1 = rand() % 1000;
	*p2 = rand() % 1000;
}

int _2048(void)
{

}